$(function() {

    Morris.Area({
        element: 'morris-area-chart',
        data: [{
            period: '2014-08',
            符合項目: 8,
            未執行: 2,
            違反規範: 7
        }, {
            period: '2014-09',
            符合項目: 7,
            未執行: 3,
            違反規範: 9
        }, {
            period: '2014-10',
            符合項目: 8,
            未執行: 2,
            違反規範: 7
        }, {
            period: '2014-11',
            符合項目: 8,
            未執行: 4,
            違反規範: 1
        }, {
            period: '2014-12',
            符合項目: 2,
            未執行: 9,
            違反規範: 1
        }, {
            period: '2015-01',
            符合項目: 7,
            未執行: 7,
            違反規範: 9
        }, {
            period: '2015-02',
            符合項目: 0,
            未執行: 4,
            違反規範: 3
        }, {
            period: '2015-03',
            符合項目: 5,
            未執行: 3,
            違反規範: 1
        }, {
            period: '2015-04',
            符合項目: 0,
            未執行: 5,
            違反規範: 8
        }, {
            period: '2015-05',
            符合項目: 3,
            未執行: 7,
            違反規範: 5
        }, {
            period: '2015-06',
            符合項目: 20,
            未執行: 4,
            違反規範: 12
        }, {
            period: '2015-07',
            符合項目: 12,
            未執行: 3,
            違反規範: 11
        }],
        xkey: 'period',
        ykeys: ['符合項目', '未執行', '違反規範'],
        labels: ['符合項目', '未執行', '違反規範'],
        pointSize: 4,
        hideHover: 'auto',
        resize: true
    });

    

    Morris.Bar({
        element: 'morris-bar-chart',
        data: [{
            y: '2006',
            a: 100,
            b: 90
        }, {
            y: '2007',
            a: 75,
            b: 65
        }, {
            y: '2008',
            a: 50,
            b: 40
        }, {
            y: '2009',
            a: 75,
            b: 65
        }, {
            y: '2010',
            a: 50,
            b: 40
        }, {
            y: '2011',
            a: 75,
            b: 65
        }, {
            y: '2012',
            a: 100,
            b: 90
        }],
        xkey: 'y',
        ykeys: ['a', 'b'],
        labels: ['Series A', 'Series B'],
        hideHover: 'auto',
        resize: true
    });

});
